#### ExternalFileUtils Members

---

|  |
| --- |
| ExternalFileUtils Class   Methods   See Also |

The  ExternalFileUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetAllExternalFileReferences | Gets the ids of all elements which are external file references. |
| Public method Static member | GetExternalFileReference | Gets the external file referencing data for the given element. |
| Public method Static member | GetFileBasedTempFolder | Gets a temp folder based on the given file name |
| Public method Static member | IsExternalFileReference | Determines whether the given element represents an external file. |

# See Also

ExternalFileUtils Class

Autodesk.Revit.DB Namespace